#### Time Count

In [178]:
from time import time
t_start = time()
print('done in %0.3f minutes.' % ((time() - t_start) / 60))

done in 0.000 minutes.

#### Time Related

In [10]:
date_format = "%Y-%m-%d"
from datetime import datetime
from datetime import timedelta
from datetime import date

now = str(date.today())
start = datetime.strptime(now, date_format)+timedelta(days=-2)
start.strftime(date_format)

now = datetime.now()
start = now + timedelta(days=-90)
start = start.strftime(date_format)
end = now + timedelta(days=-1)
end = end.strftime(date_format)

print(start,end)

2018-06-01 2018-08-29

#### Time Loop

In [3]:
from datetime import date
from dateutil.rrule import rrule, DAILY
a = date(2018, 8, 25)
b = date(2018, 8, 29)
for dt in rrule(DAILY, dtstart=a, until=b):
    datelist = dt.strftime('%Y-%m-%d').split('-')
    print(datelist)

['2018', '08', '25']
['2018', '08', '26']
['2018', '08', '27']
['2018', '08', '28']
['2018', '08', '29']

#### List

In [149]:
# append
stack = ['a','b']
stack.append(['e','f'])
# extend
stack.extend(['e','f'])

In [374]:
# sort
cars = ['Ford', 'BMW', 'Volvo']
cars.sort(reverse=True)

In [375]:
cars

['Volvo', 'Ford', 'BMW']

In [377]:
sorted(cars,reverse=False)

['BMW', 'Ford', 'Volvo']

In [144]:
a = [1,2,3,4,5]
b = [2,3,4,5,6]

a+b

[1, 2, 3, 4, 5, 2, 3, 4, 5, 6]

#### Set

In [142]:
# sort
cars = set(cars)
sorted(cars)

['BMW', 'Ford', 'Volvo']

#### DataFrame 
-  structure: https://chrisalbon.com/python/data_wrangling/pandas_data_structures/
-  drop: https://chrisalbon.com/python/data_wrangling/pandas_dropping_column_and_rows/

In [160]:
# create df, insert data from a lit
import pandas as pd
columns = ['name','year','reports']
values_by_columns = [['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],[2012, 2012, 2013, 2014, 2014], [4, 24, 31, 2, 3]]
values_by_rows = list(zip(*values_by_columns))
index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma']
df = pd.DataFrame(columns = columns)


for value in values_by_rows:
    df.loc[len(df)] = value

df.index = index

df

             name  year reports
Cochice     Jason  2012       4
Pima        Molly  2012      24
Santa Cruz   Tina  2013      31
Maricopa     Jake  2014       2
Yuma          Amy  2014       3

In [161]:
# insert a row by index
df.loc['April'] = ['Wang',2013,5]

# insert a row through append
row = pd.Series({'year':2013,'name':'Zhu','reports':30},name='Maggie')
df = df.append(row)

In [162]:
# add new column (list)
df['age'] = [20,31,40,31,25,11,6]

In [ ]:
# Row Bind
pd.concat([df1,df2])
df1.append(df2) # make sure the structure and column names are same

# Column Bind
pd.concat([df1, df2], axis=1, ignore_index=True)

In [187]:
# find duplicate - not good ... only the second one will be selected as duplicates
duplicates = df.duplicated(subset=['age'])


# drop duplicate rows
df.drop_duplicates()
# drop duplicaate and keep last one
df.drop_duplicates(keep='last')
# drop duplicate by a column name
df.drop_duplicates(['name'], keep='last')

             name  year reports  age performance  reports_ranked
Cochice     Jason  2012       4   20     Not Bad             3.0
Pima        Molly  2012      24   31     Not Bad             5.0
Santa Cruz   Tina  2013      31   40    Awesome!             7.0
Maricopa     Jake  2014       2   31     Not Bad             1.0
Yuma          Amy  2014       3   25     Not Bad             2.0
April        Wang  2013       5   11     Not Bad             4.0
Maggie        Zhu  2013      30    6    Awesome!             6.0

In [163]:
# set value base conditions
df['performance'] = 'Not Bad'
df.loc[df['reports'] >= 30, 'performance'] = 'Awesome!'

In [56]:
# iterate rows and get valeus of a,b column
for index, row in df.iterrows():
    print("index: %s | name: %s | year: %s" %(index, row['name'],row['year']))

index: Cochice | name: Jason | year: 2012
index: Pima | name: Molly | year: 2012
index: Santa Cruz | name: Tina | year: 2013
index: Maricopa | name: Jake | year: 2014
index: Yuma | name: Amy | year: 2014

In [151]:
# group 
df_agg = df.groupby(['year'])['name'].count() # pd series 
df_agg_df = df.groupby(['year'])['name'].count().reset_index() # data frame

In [167]:
df

             name  year reports  age performance
Cochice     Jason  2012       4   20     Not Bad
Pima        Molly  2012      24   31     Not Bad
Santa Cruz   Tina  2013      31   40    Awesome!
Maricopa     Jake  2014       2   31     Not Bad
Yuma          Amy  2014       3   25     Not Bad
April        Wang  2013       5   11     Not Bad
Maggie        Zhu  2013      30    6    Awesome!

In [173]:
# get column names
# 1. use .columns.values
print(list(df.columns.values))
# 2. list df directly
print(list(df))

['name', 'year', 'reports', 'age', 'performance']
['name', 'year', 'reports', 'age', 'performance']

In [176]:
# rank 
df['reports_ranked']=df['reports'].rank(ascending=1,method='dense')

In [95]:
# group + sort + top n = the most reports in each year, like in year 2012, Molly has the most report: 24
df_agg = df.groupby(['year','name'])['reports'].sum().reset_index()
df_agg_sort = df_agg.sort_values(['year','reports'],ascending=[True,False])
df_agg_sort.groupby('year').head(1)

   year   name  reports
1  2012  Molly       24
2  2013   Tina       31
5  2014    Amy        3

In [96]:
# group + value counts
df.groupby('year')['name'].value_counts() # pd series

year  name
2012  Jason    1
      Molly    1
2013  Tina     1
      Wang     1
      Zhu      1
2014  Amy      1
      Jake     1
Name: name, dtype: int64

In [97]:
# unstack: Unstack switches the rows to columns to get the activity counts as features.
df.groupby('year')['name'].value_counts().unstack().fillna('Nan')

name  Amy Jake Jason Molly Tina Wang  Zhu
year
2012  Nan  Nan     1     1  Nan  Nan  Nan
2013  Nan  Nan   Nan   Nan    1    1    1
2014    1    1   Nan   Nan  Nan  Nan  Nan

In [100]:
# more example about unstack and stack: 
# http://www.datasciencemadesimple.com/reshape-using-stack-unstack-function-pandas-python/
import pandas as pd
import numpy as np

header = pd.MultiIndex.from_product([['Semester1','Semester2'],['Maths','Science']])
d=([[12,45,67,56],[78,89,45,67],[45,67,89,90],[67,44,56,55]])
 
df = pd.DataFrame(d,index=['Alisa','Bobby','Cathrine','Jack'],columns=header)
df

stacked_df=df.stack()
unstacked_df = stacked_df.unstack()

#stack at level 1
stacked_df_lvl=df.stack(level=0)
unstacked_df1 = stacked_df_lvl.unstack()

In [115]:
# df drop row by the index name 
df1 = df.drop(['Pima'], inplace = False) # inplace = true means we are changing the original df

# Drop a row by row number - Santa Cruz
df1.drop(df1.index[1], inplace = True) # or drop a range df.index[[1,2]]

# drop row if it contains a certian value, tricky way
df1 = df1[df.name != 'Jake']

# df drop column by column name
df1.drop('reports',axis=1, inplace = True)

/usr/local/lib/python3.6/site-packages/ipykernel_launcher.py:8: UserWarning: Boolean Series key will be reindexed to match DataFrame index.

In [127]:
# df filter based on two columns value and select report column - return a series
array_jason_2012_report = df.loc[(df['name']=='Jason') & (df['year']==2012)]['reports'].values # return a array
value_jason_2012_report = df.loc[(df['name']=='Jason') & (df['year']==2012)]['reports'][0] # return a number

# df filter based on a list of value of one column -return a pd
df[df['year'].isin([2012,2013])]

In [194]:
# filter multiple rows and columns by index
df.iloc[0:2,[1,2]]
# filter multiple rows and columns by name 
df.loc[['Pima','Yuma'],['name','year']] 
# .ix[] is used to index a dataframe by both name and position
df.ix[0:2,['name','year']] 
# view a value - View the value based on row and column
df.ix[3,'name']

'Jake'

In [326]:
# pd, apply function
def num_missing(x):
    return sum(x.isnull())

#Applying per column:
print("Missing values per column:")
print(df.apply(num_missing, axis=0)) #axis=0 defines that function is to be applied on each column

#Applying per row:
print("\nMissing values per row:")
print(df.apply(num_missing, axis=1).head()) #axis=1 defines that function is to be applied on each row

Missing values per column:
name       0
year       0
reports    0
dtype: int64

Missing values per row:
Cochice       0
Pima          0
Santa Cruz    0
Maricopa      0
Yuma          0
dtype: int64

In [ ]:
# apply functions by group in pd
# Create an example dataframe
data = {'Platoon': ['A','A','A','A','A','A','B','B','B','B','B','C','C','C','C','C'],
       'Casualties': [1,4,5,7,5,5,6,1,4,5,6,7,4,6,4,6]}
df = pd.DataFrame(data)
df.groupby('Platoon')['Casualties'].apply(lambda x:x.rolling(center=False,window=2).mean())

In [135]:
# pivot table
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
                         "bar", "bar", "bar", "bar"],
                   "B": ["one", "one", "one", "two", "two",
                         "one", "one", "two", "two"],
                   "C": ["small", "large", "large", "small",
                         "small", "large", "small", "small",
                         "large"],
                   "D": [1, 2, 2, 3, 3, 4, 5, 6, 7]})

pivot_table = pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'], aggfunc=np.sum)

In [139]:
# pd, iterate

import numpy as np
import pandas as pd

df = pd.DataFrame(np.random.rand(2,4),columns=list('ABCD'))

df.head()

          A         B         C         D
0  0.490525  0.241215  0.841643  0.174706
1  0.442428  0.876786  0.537894  0.575662

In [140]:
# 1. iterate over DataFrame rows as namedtuples, with index value as first element of the tuple.
for row in df.itertuples(): 
    print(row)
print('\n')
# 2. iterate over DataFrame rows as (index, Series) pairs.
for index, row in df.iterrows():
    print(row, index)
    #print(index, row.A, row.B)
print('\n')
# 3. iterator over (column name, Series) pairs.
for index, column in df.iteritems():
    print(column)

Pandas(Index=0, A=0.4905250317945816, B=0.24121510937672574, C=0.8416430623152055, D=0.17470580936707603)
Pandas(Index=1, A=0.44242764991223027, B=0.8767860369556103, C=0.5378942261746806, D=0.5756620096035331)


A    0.490525
B    0.241215
C    0.841643
D    0.174706
Name: 0, dtype: float64 0
A    0.442428
B    0.876786
C    0.537894
D    0.575662
Name: 1, dtype: float64 1


0    0.490525
1    0.442428
Name: A, dtype: float64
0    0.241215
1    0.876786
Name: B, dtype: float64
0    0.841643
1    0.537894
Name: C, dtype: float64
0    0.174706
1    0.575662
Name: D, dtype: float64

In [ ]:
# value_counts(normalize=True) * 100 -> percent

In [353]:
# query: query the columns of a frame with a boolean expression.
from numpy.random import randn
from pandas import DataFrame
df = DataFrame(randn(10, 2), columns=list('ab'))
df.query('a > b') # equal to df[df.a > df.b]

          a         b
4  0.861259 -0.565163
5 -0.735167 -1.067934
8 -0.191366 -0.542939
9  0.722284 -0.383155

In [356]:
# difference between assign and .copy()
df1 = pd.DataFrame([1,2,3,4,5])
print(id(df1))

df2 = df1
print(id(df2)) # Same id as df1

df3 = df1.copy()
print(id(df3)) # New object, new id.

df4 = df1.copy(deep=False)
print(id(df4)) # New object, new id.

df1 = pd.DataFrame([9, 9, 9])
print(id(df1)) # New object created and bound to name 'df1'.

print(id(df2))  # Old object's id not impacted.

4384486008
4384486008
4384486064
4384381416
4384488416
4384486008

In [ ]:
# create bin using cut() function

#### Numpy

In [81]:
my_data = [1,2,3,4,5]
my_data = np.array(my_data, dtype=np.float32)

In [90]:
# sort numpy narray
np.sort(my_data)
np.sort(my_data)[::-1]

array([5., 4., 3., 2., 1.], dtype=float32)

#### Series

In [37]:
# create a series
import pandas as pd
import numpy as np
data = np.array(['a','b','c','d'])
s = pd.Series(data,index=[100,101,102,103])

In [38]:
# access data
print(s[100]) # with index lable
print(s[:3]) # with slice

a
100    a
101    b
102    c
dtype: object

In [13]:
# series iterate to get the index and value
for i, v in s.items():
    print(i,v)

100 a
101 b
102 c
103 d

In [21]:
# series to dict
s = pd.Series([1, 2, 3, 4])
s.to_dict()
{0: 1, 1: 2, 2: 3, 3: 4}

{0: 1, 1: 2, 2: 3, 3: 4}

In [ ]:
# create series from dict
data = {'a' : 0., 'b' : 1., 'c' : 2.}
s = pd.Series(data)

In [1]:
# series to Value and Index (Arrary) to List
import pandas as pd
s= pd.Series([6,3,4,6])
print(s.values.tolist(),s.index.values.tolist())

[6, 3, 4, 6] [0, 1, 2, 3]

In [ ]:
# sort: same as pd .sort_values(ascending=True)

#### Filter Rows
-  https://stackoverflow.com/questions/15325182/how-to-filter-rows-in-pandas-by-regex

#### Write CSV

In [48]:
import csv
final = [{'Name':'A','Hour':0,'Time':120},{'Name':'A','Hour':1,'Time':219}]

with open('/Users/mwang/Documents/Mine/output.csv', 'w') as output_file:
    dict_writer = csv.DictWriter(output_file, keys, delimiter=',')
    dict_writer.writeheader()
    dict_writer.writerows(final)

In [49]:
import csv
keys = ['Name','Hour','Time']
final2 = [['B', 0, 110],['C', 1, 130]]

with open('/Users/mwang/Documents/Mine/output2.csv','w') as f:
    list_writer = csv.writer(f,delimiter=',')
    list_writer.writerow(keys) # write first column name
    for row in final2:
        list_writer.writerow(row) # write each row

#### Write TSV

In [27]:
import csv
keys = ['Name','Hour','Time']
final = [{'Name':'A','Hour':0,'Time':120},{'Name':'A','Hour':1,'Time':219}]
with open('/Users/mwang/Documents/Mine/output.tsv', 'w') as output_file:
    dict_writer = csv.DictWriter(output_file, keys, delimiter='\t')
    dict_writer.writeheader()
    dict_writer.writerows(final)

#### Dict

In [20]:
from collections import defaultdict
d1 = {1: 2, 3: 4, 5: 0}
d2 = {1: 6, 3: 7, 4: 8}


# join the two dicts based on the same keys
# create new dict
dd = defaultdict(list)
# 1: all join
for d in (d1, d2): # you can list as many input dicts as you want here
    for key, value in d.items():
        dd[key].append(value)

        
        
# create new dict
dd = defaultdict(list)
# 2: left join
for k1,value in d1.items():
    dd[k1].append(value)
    if k1 in d2.keys():
        dd[k1].append(d2[k1])
    else:
        dd[k1].append('Nan')

print(dd)

defaultdict(<class 'list'>, {1: [2, 6], 3: [4, 7], 5: [0, 'Nan']})

#### Good to know

Inplace: https://stackoverflow.com/questions/45570984/pandas-is-inplace-true-considered-harmful-or-not